cfg/Catalogs/ДолжностиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДолжностиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АУП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шахтеры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоКП</Name>
					<Comment>Наименование по классификатору профессий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗКППТР</Name>
					<Comment>Код ЗКППТР</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/ДолжностиОрганизаций/Forms/ФормаПомощникЗаполненияКодаКП/Ext/Form/Module.bsl
Процедура ТабличноеПоле1РекомендуемыйКодКпНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Список = СписокСоответствияКодаПрофессии(ЭлементыФормы.ТабличноеПоле1.ТекущиеДанные.Должность);	
	ЭлементСписка = ВыбратьИзСписка(Список, Элемент, Список.НайтиПоЗначению(Элемент.Значение));
	Если ЭлементСписка <> Неопределено Тогда
		Элемент.Значение = Лев(ЭлементСписка.Значение,6)+НСтр("ru=' (всего вариантов: ';uk=' (усього варіантів: '")+Список.Количество()+")";;
		ЭлементыФормы.ТабличноеПоле1.УстановитьКодКП = Лев(ЭлементСписка.Значение,6);
	КонецЕсли;

КонецПроцедуры

Процедура ТабличноеПоле1РекомендуемыйКодКпНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Список = СписокСоответствияКодаПрофессии(ЭлементыФормы.ТабличноеПоле1.ТекущиеДанные.Должность);	
	ЭлементСписка = ВыбратьИзСписка(Список, Элемент, Список.НайтиПоЗначению(Элемент.Значение));
	
	Если ЭлементСписка <> Неопределено Тогда
		Элемент.Значение = Лев(ЭлементСписка.Значение,6)+НСтр("ru=' (всего вариантов: ';uk=' (усього варіантів: '")+Список.Количество()+")";;
		ЭлементыФормы.ТабличноеПоле1.ТекущиеДанные.УстановитьКодКП = Лев(ЭлементСписка.Значение,6);
	КонецЕсли;


КонецПроцедуры

Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Для Каждого Строка ИЗ ТЗДолжности Цикл
		Если СокрЛП(Строка.КодКп) <> СокрЛП(Строка.УстановитьКодКп) И ЗначениеЗаполнено(Строка.УстановитьКодКп) Тогда
			Должность = Строка.Должность.ПолучитьОбъект();
			Должность.КодКП = СокрЛП(Строка.УстановитьКодКп);			
			Должность.Записать();		
		КонецЕсли;
	КонецЦикла;
	Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыОтмена(Кнопка)
	Закрыть();
КонецПроцедуры

Функция СписокСоответствияКодаПрофессии(Должность)
	
	НайденнаяСтрока = ТЗПодходящихПрофессий.Найти(Должность,"Должность");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат Новый СписокЗначений();
	Иначе	
		Возврат НайденнаяСтрока.Список;
	КонецЕсли;	

КонецФункции

Процедура ЗаполнитьТЗПодходящихПрофессий()
 	
	Макет = Справочники.ДолжностиОрганизаций.ПолучитьМакет("КлассификаторПрофессийИДолжностей");
	ТЗПодходящихПрофессий.Колонки.Добавить("Должность");
	ТЗПодходящихПрофессий.Колонки.Добавить("Список");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка			КАК Ссылка,
	|	Наименование	КАК Наименование,
	|	КодКП 			КАК КодКП
	|ИЗ
	|	Справочник.ДолжностиОрганизаций";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяДолжность = ТЗПодходящихПрофессий.Добавить();
		НоваяДолжность.Должность = Выборка.Ссылка;
		СписокСоответствия = Новый СписокЗначений();
		
		ТекущаяСтрока = 0;
		ТЗ = Макет.ТекущаяОбласть;
		Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
			ТЗ = Макет.НайтиТекст(СокрЛП(Выборка.Наименование), ТЗ,,,,,Истина);		
			Если ТЗ = Неопределено Тогда
				Прервать;
			КонецЕсли;                 
					
			СтрокаКод = "R" + Формат(ТЗ.Верх,"ЧГ=0")+"C2";
			СтрокаДолжность = "R" +  Формат(ТЗ.Верх,"ЧГ=0")+"C6";
			СписокСоответствия.Добавить(Макет.Область(СтрокаКод).Текст + " " + Макет.Область(СтрокаДолжность).Текст);
			
			ТекущаяСтрока = ТЗ.Верх;
			
		КонецЦикла;
		
		НоваяДолжность.Список =  СписокСоответствия;
	
	КонецЦикла;

КонецПроцедуры

Процедура ПриОткрытии()
	
	ЗаполнитьТЗПодходящихПрофессий();
	ПолучитьДолжностьИРекомендуемыйКодКП();
	
КонецПроцедуры

Процедура ПолучитьДолжностьИРекомендуемыйКодКП();
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка			КАК Ссылка,
	|	Наименование	КАК Наименование,
	|	КодКП 			КАК КодКП
	|ИЗ
	|	Справочник.ДолжностиОрганизаций
	|УПОРЯДОЧИТЬ ПО Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗДолжности.Добавить();
		НоваяСтрока.Должность= Выборка.Ссылка;
		Если ЗначениеЗаполнено(Выборка.КодКП) Тогда
			НоваяСтрока.ФлагЗаполненностьКодКП = Истина;    
		Иначе
			НоваяСтрока.ФлагЗаполненностьКодКП = Ложь;
		КонецЕсли;
		
		НоваяСтрока.КодКП 	 = Выборка.КодКП;
		Список = СписокСоответствияКодаПрофессии(Выборка.Ссылка);
		Для Каждого элСписок ИЗ Список Цикл
			НоваяСтрока.РекомендуемыйКодКп = Лев(элСписок.Значение,6)+НСтр("ru=' (всего вариантов: ';uk=' (усього варіантів: '")+Список.Количество()+")";
			Если СокрЛП(Лев(НоваяСтрока.РекомендуемыйКодКп,6)) = СокрЛП(НоваяСтрока.КодКП) Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Если НЕ НоваяСтрока.ФлагЗаполненностьКодКП Тогда
			НоваяСтрока.УстановитьКодКП = НоваяСтрока.РекомендуемыйКодКП;
		Иначе
			НоваяСтрока.УстановитьКодКП = НоваяСтрока.КодКп;
		КонецЕсли;
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТабличноеПоле1ПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если СокрЛП(ДанныеСтроки.УстановитьКодКП) <> СокрЛП(Лев(ДанныеСтроки.РекомендуемыйКодКП,6)) Тогда
		ОформлениеСтроки.Цветфона = ЦветаСтиля.ФонЭпицентра;
	Иначе
		ОформлениеСтроки.Цветфона = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;	
	
КонецПроцедуры
